torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723ds/core/rtw_cmd.c
	if (!rfctl->dbg_dfs_master_fake_radar_detect_cnt
		&& rtw_odm_radar_detect(adapter) != _TRUE)
		goto cac_status_chk;

	if (rfctl->dbg_dfs_master_fake_radar_detect_cnt != 0) {
		RTW_INFO(FUNC_ADPT_FMT" fake radar detect, cnt:%d\n", FUNC_ADPT_ARG(adapter)
			, rfctl->dbg_dfs_master_fake_radar_detect_cnt);
		rfctl->dbg_dfs_master_fake_radar_detect_cnt--;
	}

	if (rfctl->dbg_dfs_master_radar_detect_trigger_non) {
		/* radar detect debug mode, trigger no mlme flow */
		if (0)
			RTW_INFO(FUNC_ADPT_FMT" radar detected, trigger no mlme flow for debug\n", FUNC_ADPT_ARG(adapter));
	} else {
		/* TODO: move timer to rfctl */
		struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
		int i;

		for (i = 0; i < dvobj->iface_nums; i++) {
			if (!dvobj->padapters[i])
				continue;
			if (check_fwstate(&dvobj->padapters[i]->mlmepriv, WIFI_AP_STATE)
				&& check_fwstate(&dvobj->padapters[i]->mlmepriv, WIFI_ASOC_STATE))
				break;
		}

		if (i >= dvobj->iface_nums) {
			/* what? */
			rtw_warn_on(1);
		} else {
			rtw_chset_update_non_ocp(dvobj->padapters[i]->mlmeextpriv.channel_set
				, rfctl->radar_detect_ch, rfctl->radar_detect_bw, rfctl->radar_detect_offset);
			rfctl->radar_detected = 1;

			/* trigger channel selection */
			rtw_change_bss_chbw_cmd(dvobj->padapters[i], RTW_CMDF_DIRECTLY, -1, dvobj->padapters[i]->mlmepriv.ori_bw, -1);
		}

		if (rfctl->dfs_master_enabled)
			goto set_timer;
		goto exit;
	}

cac_status_chk:

	if (!IS_CH_WAITING(rfctl) && !IS_CAC_STOPPED(rfctl)) {
		u8 pause = 0x00;

		rtw_hal_set_hwreg(adapter, HW_VAR_TXPAUSE, &pause);
		rfctl->cac_start_time = rfctl->cac_end_time = RTW_CAC_STOPPED;
	}

set_timer:
	_set_timer(&mlme->dfs_master_timer, DFS_MASTER_TIMER_MS);

exit:
	return H2C_SUCCESS;
}

u8 rtw_dfs_master_cmd(_adapter *adapter, bool enqueue)
{
	struct cmd_obj *cmdobj;
	struct drvextra_cmd_parm *pdrvextra_cmd_parm;
	struct cmd_priv *pcmdpriv = &adapter->cmdpriv;
	u8 res = _FAIL;

	if (enqueue) {
		cmdobj = (struct cmd_obj *)rtw_zmalloc(sizeof(struct cmd_obj));
		if (cmdobj == NULL)
			goto exit;

		pdrvextra_cmd_parm = (struct drvextra_cmd_parm *)rtw_zmalloc(sizeof(struct drvextra_cmd_parm));
		if (pdrvextra_cmd_parm == NULL) {
			rtw_mfree((u8 *)cmdobj, sizeof(struct cmd_obj));
			goto exit;
		}

		pdrvextra_cmd_parm->ec_id = DFS_MASTER_WK_CID;
		pdrvextra_cmd_parm->type = 0;
		pdrvextra_cmd_parm->size = 0;
		pdrvextra_cmd_parm->pbuf = NULL;

		init_h2fwcmd_w_parm_no_rsp(cmdobj, pdrvextra_cmd_parm, GEN_CMD_CODE(_Set_Drv_Extra));
		res = rtw_enqueue_cmd(pcmdpriv, cmdobj);
	} else {
		rtw_dfs_master_hdl(adapter);
		res = _SUCCESS;
	}

exit:
	return res;
}

void rtw_dfs_master_timer_hdl(RTW_TIMER_HDL_ARGS)
{
	_adapter *adapter = (_adapter *)FunctionContext;

	rtw_dfs_master_cmd(adapter, _TRUE);
}

void rtw_dfs_master_enable(_adapter *adapter, u8 ch, u8 bw, u8 offset)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	/* TODO: move timer to rfctl */
	adapter = GET_PRIMARY_ADAPTER(adapter);

	RTW_INFO(FUNC_ADPT_FMT" on %u,%u,%u\n", FUNC_ADPT_ARG(adapter), ch, bw, offset);

	if (rtw_is_cac_reset_needed(adapter, ch, bw, offset) == _TRUE)
		rtw_reset_cac(adapter, ch, bw, offset);

	rfctl->radar_detect_by_others = _FALSE;
	rfctl->radar_detect_ch = ch;
	rfctl->radar_detect_bw = bw;
	rfctl->radar_detect_offset = offset;

	rfctl->radar_detected = 0;

	if (!rfctl->dfs_master_enabled) {
		RTW_INFO(FUNC_ADPT_FMT" set dfs_master_enabled\n", FUNC_ADPT_ARG(adapter));
		rfctl->dfs_master_enabled = 1;
		_set_timer(&adapter->mlmepriv.dfs_master_timer, DFS_MASTER_TIMER_MS);

		if (rtw_rfctl_overlap_radar_detect_ch(rfctl)) {
			if (IS_CH_WAITING(rfctl)) {
				u8 pause = 0xFF;

				rtw_hal_set_hwreg(adapter, HW_VAR_TXPAUSE, &pause);
			}
			rtw_odm_radar_detect_enable(adapter);
		}
	}
}

void rtw_dfs_master_disable(_adapter *adapter, u8 ch, u8 bw, u8 offset, bool by_others)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	/* TODO: move timer to rfctl */
	adapter = GET_PRIMARY_ADAPTER(adapter);

	rfctl->radar_detect_by_others = by_others;

	if (rfctl->dfs_master_enabled) {
		bool overlap_radar_detect_ch = rtw_rfctl_overlap_radar_detect_ch(rfctl);

		RTW_INFO(FUNC_ADPT_FMT" clear dfs_master_enabled\n", FUNC_ADPT_ARG(adapter));

		rfctl->dfs_master_enabled = 0;
		rfctl->radar_detected = 0;
		rfctl->radar_detect_ch = 0;
		rfctl->radar_detect_bw = 0;
		rfctl->radar_detect_offset = 0;
		rfctl->cac_start_time = rfctl->cac_end_time = RTW_CAC_STOPPED;
		_cancel_timer_ex(&adapter->mlmepriv.dfs_master_timer);

		if (overlap_radar_detect_ch) {
			u8 pause = 0x00;

			rtw_hal_set_hwreg(adapter, HW_VAR_TXPAUSE, &pause);
			rtw_odm_radar_detect_disable(adapter);
		}
	}

	if (by_others) {
		rfctl->radar_detect_ch = ch;
		rfctl->radar_detect_bw = bw;
		rfctl->radar_detect_offset = offset;
	}
}

void rtw_dfs_master_status_apply(_adapter *adapter, u8 self_action)
{
	struct mlme_ext_priv *mlmeext = &adapter->mlmeextpriv;
	struct mi_state mstate;
	u8 u_ch, u_bw, u_offset;
	bool ld_sta_in_dfs = _FALSE;
	bool sync_ch = _FALSE; /* _FALSE: asign channel directly */
	bool needed = _FALSE;

	rtw_mi_status_no_self(adapter, &mstate);
	rtw_mi_get_ch_setting_union_no_self(adapter, &u_ch, &u_bw, &u_offset);
	if (u_ch != 0)
		sync_ch = _TRUE;

	switch (self_action) {
	case MLME_STA_CONNECTING:
		MSTATE_STA_LG_NUM(&mstate)++;
		break;
	case MLME_STA_CONNECTED:
		MSTATE_STA_LD_NUM(&mstate)++;
		break;
	case MLME_AP_STARTED:
		MSTATE_AP_NUM(&mstate)++;
		break;
	case MLME_AP_STOPPED:
	case MLME_STA_DISCONNECTED:
	default:
		break;
	}

	if (sync_ch == _TRUE) {
		if (!rtw_is_chbw_grouped(mlmeext->cur_channel, mlmeext->cur_bwmode, mlmeext->cur_ch_offset, u_ch, u_bw, u_offset)) {
			RTW_INFO(FUNC_ADPT_FMT" can't sync %u,%u,%u with %u,%u,%u\n", FUNC_ADPT_ARG(adapter)
				, mlmeext->cur_channel, mlmeext->cur_bwmode, mlmeext->cur_ch_offset, u_ch, u_bw, u_offset);
			goto apply;
		}

		rtw_sync_chbw(&mlmeext->cur_channel, &mlmeext->cur_bwmode, &mlmeext->cur_ch_offset
			, &u_ch, &u_bw, &u_offset);
	} else {
		u_ch = mlmeext->cur_channel;
		u_bw = mlmeext->cur_bwmode;
		u_offset = mlmeext->cur_ch_offset;
	}

	if (MSTATE_STA_LD_NUM(&mstate) > 0) {
		/* rely on AP on which STA mode connects */
		if (rtw_is_dfs_ch(u_ch, u_bw, u_offset))
			ld_sta_in_dfs = _TRUE;
		goto apply;
	}

	if (MSTATE_STA_LG_NUM(&mstate) > 0) {
		/* STA mode is linking */
		goto apply;
	}

	if (MSTATE_AP_NUM(&mstate) == 0) {
		/* No working AP mode */
		goto apply;
	}

